A generic error has occurred.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GenericWarning { get; }
  Visual Basic
Public Shared ReadOnly Property GenericWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GenericWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace